# Outils de base
brew "bat"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "shellcheck"

# Remplacement moderne de ls (icônes, git, tree)
brew "eza"

# Navigation intelligente de répertoires (apprentissage automatique)
brew "zoxide"

# Prompt shell cross-shell ultra-rapide (Rust)
brew "starship"

# Pager git diff avec coloration syntaxique et side-by-side
brew "git-delta"

# Visualisation d'espace disque en arbre intuitif
brew "dust"

# Moniteur système full TUI (CPU, RAM, GPU, réseau)
brew "btop"

# Liste de processus moderne et lisible
brew "procs"

# Benchmarking CLI avec statistiques et warmup
brew "hyperfine"

# Rendu Markdown dans le terminal
brew "glow"

# Moteurs de rendu d'image
brew "chafa"
brew "imagemagick"
brew "ffmpegthumbnailer"

# Analyse de layers Docker/Podman (efficacité, wasted space)
brew "dive"

# L'outil de déploiement lui-même
brew "chezmoi"
